Tekla Open API Reference for Tekla Structures 2025
Events.ModelUnloadingSync Event
 The ModelUnloadingSync event is raised synchronously on the main thread just before the model is unloaded.
 Use this event only when core resources need be cleaned up before the model unloading proceeds. All UI-only related resource cleanup should be done in the async ModelUnloading event.
OnModelUnloadingSync(String, Object[])
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public event Events.ModelLoadDelegate ModelUnloadingSync
Public Event ModelUnloadingSync As Events.ModelLoadDelegate
Value
Type: Tekla.Structures.Model.Events.ModelLoadDelegate
See Also
Reference
Events Class
Tekla.Structures.Model Namespace